IDEA StatiCa Open Model
LoadBase Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Load base object
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Detail.Loading.LoadBase
 IdeaRS.OpenModel.Detail.Loading.LineLoad
 Namespace: IdeaRS.OpenModel.Detail.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class LoadBase : OpenObject
Public MustInherit Class LoadBase
	Inherits OpenObject
public ref class LoadBase abstract : public OpenObject
The LoadBase type exposes the following members.
Constructors
Name | Description
LoadBase
Initializes a new instance of the LoadBase class
Top
Properties
Name | Description
Id
 Element Id
Top
See Also
Reference
IdeaRS.OpenModel.Detail.Loading Namespace